export const CATEGORIES: any = [
    {
        name: 'الأكثر طلباً'
    },
    {
        name: 'المقبلات'
    },
    {
        name: 'الأطباق الرئيسية'
    },
    {
        name: 'البيتزا'
    },
    {
        name: 'المعكرونة'
    },
    {
        name: 'الأطباق البحرية'
    },
    {
        name: 'السندويشات'
    },
    {
        name: 'المشروبات'
    },
    {
        name: 'الحلويات'
    }
]

const modifiers = ['صلصة حارة', 'زيتون أسود', 'بصل مكرمل', 'مشروم', 'جبنة دبل']
const sizes = [
    {
        size: 'صغير',
        price: 35
    },
    {
        size: 'وسط',
        price: 45
    },
    {
        size: 'كبير',
        price: 55
    }
]

export const FOOD_MENU: any = {
    'الأكثر طلباً': [
        {
            name: 'دجاج الفطر بالفاصولياء',
            image: '/images/food/1.jpg',
            rate: 4.5,
            desc: 'صلصة طماطم، جبنة موزاريلا، دجاج مشوي، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 20,
            sizes,
            modifiers
        },
        {
            name: 'سمك السالمون مع الخضار',
            image: '/images/food/2.jpg',
            rate: 4.3,
            desc: 'أفوكادو، طماطم، سمك سالمون، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 25,
            sizes,
            modifiers
        },
        {
            name: 'سمك السالمون مع الخضار',
            image: '/images/food/2.jpg',
            rate: 4.3,
            desc: 'أفوكادو، طماطم، سمك سالمون، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 25,
            sizes,
            modifiers
        }
    ],
    'البيتزا': [
        {
            name: 'بيتزا خضار مشكل',
            image: '/images/food/4.jpg',
            rate: 4.0,
            desc: 'صلصة طماطم، جبنة موزاريلا، دجاج مشوي، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 20,
            sizes,
            modifiers
        },
        {
            name: 'بيتزا البيبروني',
            image: '/images/food/5.jpg',
            rate: 4.3,
            desc: 'أفوكادو، طماطم، سمك سالمون، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 25,
            sizes,
            modifiers
        },
        {
            name: 'سمك السالمون مع الخضار',
            image: '/images/food/5.jpg',
            rate: 4.3,
            desc: 'أفوكادو، طماطم، سمك سالمون، فلفل ألوان، زيتون أسود، بصل مكرمل، مشروم، بارميزان، وأوراق ريحان',
            price: 25,
            sizes,
            modifiers
        }
    ]
}
